app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    #passing the params[:author_id] into any spot looking for author to make sure that,
    # if we capture an author_id through a nested route, we keep track
    # of it and assign the post to that author, then carrying this id
    # with us for the next few steps, babysitting it through the server request/response cycle.
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
    else
      @posts = Post.all

SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"
---
  def new
    #check for params[:author_id] and then for Author.exists?
    #to see if the author is real.

    #Why aren't we doing a find_by to author instance?
    #Bc we don't need a whole author instance for Post.new;
    #we just need the author_id. And we don't need to check against
    #the posts of the author because we're just creating a new one.
    #So we use exists? to quickly/efficiently check the database
    if params[:author_id] && !Author.exists?(params[:author_id])

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]
---
  def edit
    #full url entered: authors/author_id/posts/:id/edit OR /posts/:id/edit
    #check if user enters an author_id (ie any number) into browser as authors/:author_id
    if params[:author_id]
      #check if an author is found at the author_id entered into browser by user
      author = Author.find_by(id: params[:author_id])
      #if there is no author with that id
      if author.nil?
        #redirect to authors index page w/ error
        redirect_to authors_path, alert: "Author not found."
      else
        #else try to find a post that exists for that author
        #with the post's id entered into browser at: authors/author_id/posts/:id ...
        #if there is not a post w/ that id, redirect to authors/author_id/posts
        #to show all the posts associated with that author and flash alert message
        @post = author.posts.find_by(id: params[:id])